---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.PrimaryEnd
source: html/d404fc0d-f7ac-7080-e38d-d59feaf49ffa.htm
---
# Autodesk.Revit.DB.GroupTypeId.PrimaryEnd Property

Primary End.

## Syntax (C#)
```csharp
public static ForgeTypeId PrimaryEnd { get; }
```